In [1]:
import sys
import os
sys.path.append("../")
from datapath import base_path, data_path

In [4]:
import pandas as pd
df = pd.read_csv(os.path.join(data_path, "gapminder.tsv"), sep="\t")

In [5]:
avg_life_exp_by_year = df.groupby("year").lifeExp.mean()
print(avg_life_exp_by_year)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [6]:
years = df.year.unique()

In [7]:
years

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [9]:
y1952 = df.loc[df.year == 1952, :]

In [10]:
y1952.head()

        country continent  year  lifeExp       pop    gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333   779.445314
12      Albania    Europe  1952   55.230   1282697  1601.056136
24      Algeria    Africa  1952   43.077   9279525  2449.008185
36       Angola    Africa  1952   30.015   4232095  3520.610273
48    Argentina  Americas  1952   62.485  17876956  5911.315053

In [11]:
y1952_mean = y1952.lifeExp.mean()
print(y1952_mean)

49.057619718309866

In [14]:
y1957 = df.loc[df.year == 1957, :]

        country continent  year  lifeExp       pop    gdpPercap
1   Afghanistan      Asia  1957   30.332   9240934   820.853030
13      Albania    Europe  1957   59.280   1476505  1942.284244
25      Algeria    Africa  1957   45.685  10270856  3013.976023
37       Angola    Africa  1957   31.999   4561361  3827.940465
49    Argentina  Americas  1957   64.399  19610538  6856.856212

In [15]:
y1957_mean = y1957.lifeExp.mean()

In [17]:
y1957_mean

51.50740112676056

In [18]:
y1962 = df.loc[df.year == 1962, :]
y1962_mean = y1962.lifeExp.mean()

y2007 = df.loc[df.year == 2007, :]
y2007_mean = y2007.lifeExp.mean()

In [19]:
df2 = pd.DataFrame({
    "year": [1952, 1957, 1962, 2007],
    "":[y1952_mean, y1957_mean, y1962_mean, y2007_mean]
})

In [20]:
df2.head()

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [28]:
df[["year", "gdpPercap"]].groupby("year").mean()

         gdpPercap
year
1952   3725.276046
1957   4299.408345
1962   4725.812342
1967   5483.653047
1972   6770.082815
1977   7313.166421
1982   7518.901673
1987   7900.920218
1992   8158.608521
1997   9090.175363
2002   9917.848365
2007  11680.071820

In [29]:
def my_mean(values):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    
    return sum / n

In [32]:
agg_my_mean = df.groupby("year").lifeExp.agg(my_mean)
print(agg_my_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [33]:
def my_mean_diff(values, diff_value):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    mean = sum / n
    return mean - diff_value

In [34]:
global_mean = df.lifeExp.mean()
print(global_mean)

agg_mean_diff = df.groupby("year").lifeExp.agg(my_mean_diff, diff_value=global_mean)

59.474439366197174

In [35]:
agg_mean_diff

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [36]:
import numpy as np
#여러개의 method 동시에 사용가능.
gdf = df.groupby("year").lifeExp.agg([np.count_nonzero, np.mean, np.std])
print(gdf)

      count_nonzero       mean        std
year
1952            142  49.057620  12.225956
1957            142  51.507401  12.231286
1962            142  53.609249  12.097245
1967            142  55.678290  11.718858
1972            142  57.647386  11.381953
1977            142  59.570157  11.227229
1982            142  61.533197  10.770618
1987            142  63.212613  10.556285
1992            142  64.160338  11.227380
1997            142  65.014676  11.559439
2002            142  65.694923  12.279823
2007            142  67.007423  12.073021

C:\Users\Suseong Kim\AppData\Local\Temp\ipykernel_11084\3722990631.py:3: FutureWarning: The provided callable <function mean at 0x000001F8400D8400> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  gdf = df.groupby("year").lifeExp.agg([np.count_nonzero, np.mean, np.std])
C:\Users\Suseong Kim\AppData\Local\Temp\ipykernel_11084\3722990631.py:3: FutureWarning: The provided callable <function std at 0x000001F8400D8540> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  gdf = df.groupby("year").lifeExp.agg([np.count_nonzero, np.mean, np.std])

In [37]:
gdf_dict = df.groupby("year").agg(
    {
        "lifeExp" : "mean",
        "pop": "median",
        "gdpPercap": "median"
    }
)
print(gdf_dict)

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334740
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371108

In [38]:
def my_zscore(x): #열 한줄이 들어간다고 생각하면 함수를 좀더 쉽게 짤수 있다.
    return (x - x.mean()) / x.std()

In [39]:
transform_z = df.groupby("year").lifeExp.transform(my_zscore)

In [40]:
transform_z.head()

0   -1.656854
1   -1.731249
2   -1.786543
3   -1.848157
4   -1.894173
Name: lifeExp, dtype: float64

In [41]:
print(df.shape)

(1704, 6)

In [42]:
print(transform_z.shape)

(1704,)

In [43]:
import seaborn as sns
import numpy as np

np.random.seed(42)

In [44]:
tips_10 = sns.load_dataset("tips").sample(10)
tips_10.loc[np.random.permutation(tips_10.index)[:4], "total_bill"] = np.NaN
print(tips_10)

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153         NaN  2.00    Male     No   Sun  Dinner     4
211         NaN  5.16    Male    Yes   Sat  Dinner     4
198         NaN  2.00  Female    Yes  Thur   Lunch     2
176         NaN  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [45]:
count_sex = tips_10.groupby("sex").count()

C:\Users\Suseong Kim\AppData\Local\Temp\ipykernel_11084\1736131433.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  count_sex = tips_10.groupby("sex").count()

In [46]:
print(count_sex)

        total_bill  tip  smoker  day  time  size
sex
Male             4    7       7    7     7     7
Female           2    3       3    3     3     3

In [47]:
def fill_na_mean(x):
    avg = x.mean()
    return x.fillna(avg)

In [48]:
total_bill_group_mean = tips_10.groupby("sex").total_bill.transform(fill_na_mean)
tips_10["fill_total_bill"] = total_bill_group_mean
print(tips_10)

     total_bill   tip     sex smoker   day    time  size  fill_total_bill
24        19.82  3.18    Male     No   Sat  Dinner     2          19.8200
6          8.77  2.00    Male     No   Sun  Dinner     2           8.7700
153         NaN  2.00    Male     No   Sun  Dinner     4          17.9525
211         NaN  5.16    Male    Yes   Sat  Dinner     4          17.9525
198         NaN  2.00  Female    Yes  Thur   Lunch     2          13.9300
176         NaN  2.00    Male    Yes   Sun  Dinner     2          17.9525
192       28.44  2.56    Male    Yes  Thur   Lunch     2          28.4400
124       12.48  2.52  Female     No  Thur   Lunch     2          12.4800
9         14.78  3.23    Male     No   Sun  Dinner     2          14.7800
101       15.38  3.00  Female    Yes   Fri  Dinner     2          15.3800

C:\Users\Suseong Kim\AppData\Local\Temp\ipykernel_11084\3642889372.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  total_bill_group_mean = tips_10.groupby("sex").total_bill.transform(fill_na_mean)